import React from 'react';

function MethodPage() {
  return (
    <div>
        <h2>英単語は、機械的に覚えるべからず</h2>
        <p>英単語をターゲットやシステム英単語で一対一で勉強している人は多い。</p>
        <p>しかし、私はあまりオススメしない。</p>
        <p>基礎を固めるという意味では、なんとなく知っている単語の数を増やすことは有用だ。</p>
        <p>しかし、無機質に覚えるだけでは、本当の理解は見につかない。</p>
        <p>結果として、応用が出来ない、使えない知識しか見につかないのだ。</p>
        
        <h2>英単語は、文章で覚える</h2>
        <p>英単語を多角的に理解することのメリットは多岐にわたる。</p>
        <ul>
            <li>知らない意味で使われていても文脈から推測できる。</li>
            <li>感覚的に単語を理解しているため、高速で処理できる。</li>
            <li>英作文でも応用できる。</li>
        </ul>
    </div>
    );
}

export default MethodPage;
